export const spriteMap  = {
    //блоки
    1:[11 * 32, 5 * 32, 64, 64],//четвертинка кирпичного блока
    2:[9 * 32, 5 * 32, 64, 64], //четвертинка бетонного блока

    3:[14 * 32, 5 * 32, 32, 64],//правая кирпичная 1/8
    4:[15 * 32, 5 * 32, 64, 32],//верхняя кирпичная 1/8
    5:[18 * 32, 5 * 32, 64, 32],//нижняя кирпичная 1/8
    6:[17 * 32, 5 * 32, 32, 64],//левая кирпичная 1/8

    //танк первого игрока
    7:[0 * 32, 0, 32, 32], //up
    8:[1 * 32, 0, 32, 32], //right
    9:[2 * 32, 0, 32, 32], //down
    10:[3 * 32, 0, 32, 32], //left

    //пуля
    11:[18 * 32, 10 * 32, 6, 8], //up
    12:[19 * 32, 10 * 32, 8, 6], //right
    13:[20 * 32, 10 * 32, 6, 8], //down
    14:[21 * 32, 10 * 32, 8, 6], //left

    //взрыв от самого маленького к большому
    15:[10 * 32, 10 * 32, 32, 32],
    16:[11 * 32, 10 * 32, 32, 32],
    17:[12 * 32, 10 * 32, 32, 32],
    18:[13 * 32, 10 * 32, 64, 64],
    19:[15 * 32, 10 * 32, 64, 64],

    // 0: [0, 0, 0, 0], //черный блок
    // 1: [8 * 32, 6 * 32, 32, 32], //целый кирпичный блок
    // 2: [10 * 32, 6 * 32, 32, 32], //левая половина кирпичного блока
    // 3: [12 * 32, 6 * 32, 32, 32], //нижняя половина кирпичного блока
    // 4: [14 * 32, 6 * 32, 32, 32], //правая половина кирпичного блока
    // 5: [16 * 32, 6 * 32, 32, 32], //верхняя половина кирпичного блока
    // 6:[17 * 32, 6 * 32, 5, 32], //левая кирпичная 1/8
    // 7:[18 * 32, 6 * 32, 5, 32], //верхняя кирпичная 1/8
    // 8:[19 * 32, 6 * 32, 5, 32], //нижняя кирпичная 1/8
    // 9:[20 * 32, 6 * 32, 5, 32], //правая кирпичная 1/8
    // 20:[18 * 32, 8 * 32, 16, 16],//четвертинка кирпичного блока
    // 21:[21 * 32, 8 * 32, 32, 32],//право низ 1/4
    // 22:[20 * 32, 8 * 32, 32, 32],//лево верх 1/4
    // 23:[22 * 32, 8 * 32, 32, 32],//право верх 1/4

    // 10: [8 * 32, 8 * 32, 32, 32], //целый бетонный блок
    // 11: [10 * 32, 8 * 32, 32, 32], //левая половина бетонного блока
    // 12: [12 * 32, 8 * 32, 32, 32], //нижняя половина бетонного блока
    // 13: [14 * 32, 8 * 32, 32, 32], //правая половина бетонного блока
    // 14: [16 * 32, 8 * 32, 32, 32], //верхняя половина бетонного блока
    // 15:[17 * 32, 8 * 32, 16, 16], //четвертинка бетонного блока

    
}